app/Controllers/ProductoController.php

    public function productosPorCategoria($categoriaId = null){
        $productoModel = new Producto_Model();
        $categoriaModel = new categoria_model();

        // Si se pasa un ID de categoría
        if ($categoriaId) {
            // Buscar categoría
            $categoria = $categoriaModel->find($categoriaId);
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '3'