app/Controllers/ProductoController.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '31'
---
   public function obtenerVentas()
{
    $ventasCabeceraModel = new \App\Models\Ventas_cabecera_model();
    $ventasDetalleModel = new \App\Models\Ventas_detalle_model();
    $productoModel = new Producto_model();

    $id_usuario = session()->get('usuario_id');

    // Obtener fechas del GET
    $fecha_inicio = $this->request->getGet('fecha_inicio');
    $fecha_fin = $this->request->getGet('fecha_fin');

    // Formatear fechas con horas para asegurar el rango completo
    if ($fecha_inicio) {
        $fecha_inicio .= ' 00:00:00';
    }
    if ($fecha_fin) {
        $fecha_fin .= ' 23:59:59';
    }

    // Usar método del modelo con los parámetros
    $ventasCabeceras = $ventasCabeceraModel->getVentas($id_usuario, $fecha_inicio, $fecha_fin);

    $ventas = [];

    foreach ($ventasCabeceras as $venta) {
        $detalles = $ventasDetalleModel->getDetalles($venta['id']);

        foreach ($detalles as $detalle) {
            $producto = $productoModel->find($detalle['producto_id']);

SELECT *
FROM `productos`
WHERE `eliminado` = 0
---
    public function productosPorCategoria($categoriaId = null)
    {
        $productoModel = new Producto_Model();
        $categoriaModel = new categoria_model();

        // Si se pasa un ID de categoría
        if ($categoriaId) {
            // Buscar categoría
            $categoria = $categoriaModel->find($categoriaId);

            if (!$categoria) {
                throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Categoría no encontrada');
            }

            // Obtener productos de esa categoría
            $productos = $productoModel
                ->where('eliminado', 0)
                ->where('categoria_id', $categoriaId)
                ->findAll();

            $titulo = 'Categoría: ' . $categoria['descripcion'];
        } else {
            // Si no hay categoría, mostrar todos los productos
            $productos = $productoModel->where('eliminado', 0)->findAll();