app/Controllers/ProductoController.php

SELECT *
FROM `productos`
WHERE `eliminado` = 0
---
    public function index() {
        $productoModel = new Producto_Model();
        $data['productos'] = $productoModel->where('eliminado', 0)->findAll();

SELECT *
FROM `productos`
WHERE `eliminado` = 0
---
    public function mostrarProductosFront() {
        $session = session();
        $categoria = $session->get('id'); // ID de la categoría seleccionada

        $productoModel = new Producto_Model();

        // Filtrar productos por 'eliminado = 0' y por 'categoria_id'
        if ($categoria) {
            $productos = $productoModel
                ->where('eliminado', 0)
                ->where('categoria_id', $categoria)
                ->findAll();
        } else {
            // Si no hay categoría, mostrar todos los productos no eliminados
            $productos = $productoModel->where('eliminado', 0)->findAll();

SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '4'
SELECT *
FROM `productos`
WHERE `eliminado` = 0
AND `categoria_id` = '4'
---
    public function productosPorCategoria($categoriaId = null)
{
    $productoModel = new Producto_Model();
    $categoriaModel = new categoria_model();

    // Si se pasa un ID de categoría
    if ($categoriaId) {
        // Buscar categoría
        $categoria = $categoriaModel->find($categoriaId);

        if (!$categoria) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Categoría no encontrada');
        }

        // Obtener productos de esa categoría
        $productos = $productoModel
            ->where('eliminado', 0)
            ->where('categoria_id', $categoriaId)
            ->findAll();

        $titulo = 'Categoría: ' . $categoria['descripcion'];
    } else {
        // Si no hay categoría, mostrar todos los productos
        $productos = $productoModel->where('eliminado', 0)->findAll();