app/Controllers/Usuario_controller.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $userModel = new Usuarios_model();
        $data['usuarios'] = $userModel->findAll();