app/Models/Producto_model.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '29'
---
    public function getProducto($id)
    {
        return $this->find($id);