app/Models/Producto_model.php

    public function getProductoAll()
    {
        return $this->findAll(); // devuelve todos los productos
---
SELECT *
FROM `productos`