app/Models/Ventas_detalle_model.php

    public function getDetalles($venta_id)
    {
        return $this->where('venta_id', $venta_id)->findAll();
---
SELECT *
FROM `ventas_detalle`
WHERE `venta_id` = '20'