app/Models/Ventas_cabecera_model.php

    public function getVentas($usuario_id = null)
    {
        // El builder se inicia con la tabla principal del modelo
        $builder = $this->builder();

        // Seleccionamos todos los campos de ventas_cabecera y los campos nombre y apellido de la tabla usuarios
        // Es importante seleccionar solo los campos necesarios para evitar traer datos sensibles como la contraseña
        $builder->select('ventas_cabecera.*, usuarios.nombre, usuarios.apellido');

        // Realizamos un JOIN con la tabla de usuarios.
        // Se usa 'usuarios.id' porque el modelo Usuarios_model define 'id' como su clave primaria.
        $builder->join('usuarios', 'usuarios.id = ventas_cabecera.usuario_id');

        // Si se proporciona un ID de usuario, filtramos las ventas por ese usuario
        if ($usuario_id !== null) {
            $builder->where('ventas_cabecera.usuario_id', $usuario_id);
        }

        // Ordenamos las ventas por fecha en orden descendente (las más recientes primero)
        $builder->orderBy('ventas_cabecera.fecha', 'DESC');

        // Ejecutamos la consulta y devolvemos los resultados como un array de arrays
        return $builder->get()->getResultArray();
---
SELECT `ventas_cabecera`.*, `usuarios`.`nombre`, `usuarios`.`apellido`
FROM `ventas_cabecera`
JOIN `usuarios` ON `usuarios`.`id` = `ventas_cabecera`.`usuario_id`
ORDER BY `ventas_cabecera`.`fecha` DESC